kangminsukk/STM32F401_Project/F401_ADC/F401_ADC_Test01/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define User_Button_Pin GPIO_PIN_13
#define User_Button_GPIO_Port GPIOC
#define FND_RIGHT_PORT_Pin GPIO_PIN_0
#define FND_RIGHT_PORT_GPIO_Port GPIOC
#define FND_LEFT_PORT_Pin GPIO_PIN_1
#define FND_LEFT_PORT_GPIO_Port GPIOC
#define FND_C_PORT_Pin GPIO_PIN_2
#define FND_C_PORT_GPIO_Port GPIOA
#define FND_B_PORT_Pin GPIO_PIN_3
#define FND_B_PORT_GPIO_Port GPIOA
#define FND_DOTC_PORT_Pin GPIO_PIN_0
#define FND_DOTC_PORT_GPIO_Port GPIOB
#define FND_F_PORT_Pin GPIO_PIN_10
#define FND_F_PORT_GPIO_Port GPIOB
#define FND_A_PORT_Pin GPIO_PIN_8
#define FND_A_PORT_GPIO_Port GPIOA
#define FND_DOT_PORT_Pin GPIO_PIN_10
#define FND_DOT_PORT_GPIO_Port GPIOA
#define FND_D_PORT_Pin GPIO_PIN_3
#define FND_D_PORT_GPIO_Port GPIOB
#define FND_G_PORT_Pin GPIO_PIN_4
#define FND_G_PORT_GPIO_Port GPIOB
#define FND_E_PORT_Pin GPIO_PIN_5
#define FND_E_PORT_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
